src/cf/InformationRegisters/ор_СтатусыИнформированияАптекаРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_СтатусыИнформированияАптекаРУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_СтатусыОбменаАптекаРУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусАптекаРУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ор_СтатусыИнформированияАптекаРУ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СообщениеОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_НастройкиОбменаСАптекаРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_НастройкиОбменаСАптекаРУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ор_СтатусыОбменаАптекаРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ор_СтатусыОбменаАптекаРУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыдаче</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ор_СтатусыИнформированияАптекаРУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ор_СтатусыИнформированияАптекаРУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Success</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Conflict</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unknown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotFound</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AlreadyReported</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ор_ОбменСАптекаРУВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обрабатывает действие заказа при обмене.
//
// Параметры:
//  МассивЗаказов   - Массив - массив заказов.
//  Действие        - Строка - текущее действие по обмену.
//  Организация     - СправочникСсылка.Организации - ссылка на организацию.
// 
// Возвращаемое значение:
//  Структура - структура возвращаемого ответа
//
Функция ОбработатьЗаказИПередатьВАптекаРу(МассивЗаказов, Действие, Организация) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"                 , "");
	ВозвращаемоеЗначение.Вставить("СообщениеСервисаДляЭлемента" , "");
	ВозвращаемоеЗначение.Вставить("ПредставлениеСтатуса"        , "");
	ВозвращаемоеЗначение.Вставить("СтатусОбмена"                , Неопределено);
	
	СоответствиеЗаказНомер = Новый Соответствие();
	
	// Формируем тело запроса в виде массива
	ТелоЗапроса = Новый Массив();
	Для Каждого Заказ Из МассивЗаказов Цикл
		НомерЗаказа = Заказ.ор_НомерЗаказаАптекаРУ;
		Если ЗначениеЗаполнено(НомерЗаказа) Тогда
			ТелоЗапроса.Добавить(НомерЗаказа);
			СоответствиеЗаказНомер.Вставить(НомерЗаказа, Заказ);
		КонецЕсли;
	КонецЦикла;
	
	Если ТелоЗапроса.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	СоответствиеАдресов = ор_ОбменСАптекаРУПовтИсп.ПолучитьСоответствиеАдресовСервиса();
	АдресЗапроса = СоответствиеАдресов.Получить(Действие);
	Если АдресЗапроса = Неопределено Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
		
	СтруктураТела = Новый Структура();
	СтруктураТела.Вставить("orderNums", ТелоЗапроса);
	
	// сериализуем тело в JSON.
	ТелоЗапросаJSON = ОбъектВТекстJSON(СтруктураТела);
	
	// Вернуть
	ОтветСервиса = ВыполнитьЗапрос(АдресЗапроса, ТелоЗапросаJSON,, Организация);
	Если ЗначениеЗаполнено(ОтветСервиса.ТекстОшибки) Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ОтветСервиса.ТекстОшибки;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	ОбъектОтвет = ОтветСервиса.ОбъектОтвет;
	
	ОтветСоответствуетОжидаемому = Ложь;
	
	Если ОбъектОтвет.Свойство("orderNums")
		И ТипЗнч(ОбъектОтвет.orderNums) = Тип("Массив")
		И ОбъектОтвет.orderNums.Количество() > 0 Тогда
		
		ОтветСоответствуетОжидаемому = Истина;
		
	КонецЕсли;
	
	Если ОтветСоответствуетОжидаемому Тогда
		ОбновитьТекущийСтатусЗаказаНаОснованииОтветаСервиса(МассивЗаказов, ОбъектОтвет.orderNums, ВозвращаемоеЗначение, Действие, СоответствиеЗаказНомер);
	Иначе
		ВозвращаемоеЗначение.ТекстОшибки = НСтр("ru = 'Формат данных сервиса отличается от ожидаемого'");
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Процедура - Установить параметры сеанса
//
// Параметры:
//  Организация			 - СправочникСсылка.Организации - ссылка на организацию
//  Токен				 - Строка - Токен авторизации
//  ВремяЖизниВМинутах	 - Строка - Срок действия в минутах
//
Процедура ЗаполнитьПараметрыСеанса(Организация, Токен, ВремяЖизниВМинутах) Экспорт
	
	Если Не ЗначениеЗаполнено(Токен) 
		И Не ЗначениеЗаполнено(ВремяЖизниВМинутах) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураАвторизации = Новый Структура();
	СтруктураАвторизации.Вставить("Токен"       , Токен);
	СтруктураАвторизации.Вставить("СрокДействия", ТекущаяДатаСеанса() + (60 * ВремяЖизниВМинутах));
	
	ТекущееСоответствие = Новый Соответствие(ПараметрыСеанса.ор_ДанныеСессииАптекаРУ);
	ТекущееСоответствие.Вставить(Организация, Новый ФиксированнаяСтруктура(СтруктураАвторизации));
	
	ПараметрыСеанса.ор_ДанныеСессииАптекаРУ = Новый ФиксированноеСоответствие(ТекущееСоответствие);
	
КонецПроцедуры

// Функция - После пробития чека
//
// Параметры:
//  ЧекККМСсылка - ДокументСсылка.ЧекККМ - ссылка на ЧекККМ
// 
// Возвращаемое значение:
//  Структура - структура выводимой информации в РМК при наличии
//
Функция ПослеПробитияЧека(ЧекККМСсылка) Экспорт
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ТекстОшибки", "");
		
	Если Не ПолучитьФункциональнуюОпцию("ор_ИспользоватьОбменСАптекаРУ") Тогда 
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ЗаказПокупателя = ЧекККМСсылка.Заказ;
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	МассивПередачи = Новый Массив();
	МассивПередачи.Добавить(ЗаказПокупателя);
	
	Результат = ОбработатьЗаказИПередатьВАптекаРу(МассивПередачи, "ПередатьДанныеОВыкупленномЗаказе", ЗаказПокупателя.Организация);
	Если ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
		СтруктураВозврата.ТекстОшибки = Результат.ТекстОшибки;
	ИначеЕсли ЗначениеЗаполнено(Результат.СообщениеСервисаДляЭлемента) Тогда
		СтруктураВозврата.ТекстОшибки = 
			СтрШаблон(НСтр("ru = 'Ошибка при выполнении HTTP запроса в Аптека.ру по номеру заказа %1'"), ЗаказПокупателя.ор_НомерЗаказаАптекаРУ)
			+ Символы.ПС + Результат.СообщениеСервисаДляЭлемента;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция - Получить текущие статусы заказов
//
// Параметры:
//  МассивЗаказов - Массив - массив ссылок на заказы покупателей
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица текущих статусов заказов
//
Функция ПолучитьТекущиеСтатусыЗаказов(МассивЗаказов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ор_СтатусыИнформированияАптекаРУ.СтатусОбмена КАК СтатусОбмена,
		|	ор_СтатусыИнформированияАптекаРУ.СообщениеОбОшибке КАК СообщениеОбОшибке,
		|	ор_СтатусыИнформированияАптекаРУ.ЗаказПокупателя КАК ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.ор_СтатусыИнформированияАптекаРУ КАК ор_СтатусыИнформированияАптекаРУ
		|ГДЕ
		|	ор_СтатусыИнформированияАптекаРУ.ЗаказПокупателя В (&МассивЗаказов)";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция - Получить текущий статус заказа
//
// Параметры:
//  ЗаказПокупателя			 - ДокументСсылка.ЗаказПокупателя - ссылка на заказ.
//  ТекущиеСтатусыЗаказов	 - ТаблицаЗначений - таблица текущих статусов заказов.
// 
// Возвращаемое значение:
//  Структура - структура текущего статуса заказа
//
Функция ПолучитьТекущийСтатусЗаказа(ЗаказПокупателя, ТекущиеСтатусыЗаказов = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("СтатусОбмена"     , Перечисления.ор_СтатусыОбменаАптекаРУ.ПустаяСсылка());
	ВозвращаемоеЗначение.Вставить("СообщениеОбОшибке", "");
	
	Если ТекущиеСтатусыЗаказов = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ор_СтатусыИнформированияАптекаРУ.СтатусОбмена КАК СтатусОбмена,
		|	ор_СтатусыИнформированияАптекаРУ.СообщениеОбОшибке КАК СообщениеОбОшибке
		|ИЗ
		|	РегистрСведений.ор_СтатусыИнформированияАптекаРУ КАК ор_СтатусыИнформированияАптекаРУ
		|ГДЕ
		|	ор_СтатусыИнформированияАптекаРУ.ЗаказПокупателя = &ЗаказПокупателя";
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат ВозвращаемоеЗначение;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, Выборка);
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	НайденнаяСтрока = ТекущиеСтатусыЗаказов.Найти(ЗаказПокупателя);
	Если НайденнаяСтрока <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, НайденнаяСтрока);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция - Сформировать представление статуса заказа
//
// Параметры:
//  ТекущийСтатус		 - ПеречислениеСсылка.ор_СтатусыОбменаАптекаРУ - текущий статус
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока - представления статуса заказа
//
Функция СформироватьПредставлениеСтатусаЗаказа(ТекущийСтатус) Экспорт
	
	ФорматированныеСтроки = Новый Массив;
	Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.ПустаяСсылка") Тогда
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока("Черновик"));
	Иначе
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(Строка(ТекущийСтатус)));
	КонецЕсли;
	
	ТекстГиперссылки   = "";
	СодержимоеДействия = НСтр("ru = 'передайте данные'");
	
	// Определение порядка действий с заказом в зависимости от текущего статуса.
	ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(", "));
	Если ТекущийСтатус = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.Принят") Тогда
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='заказ готов к выдаче.'"),,ЦветаСтиля.ГиперссылкаЦвет,,"ПередатьДанныеОГотовностиКВыдачеЗаказа"));
	ИначеЕсли ТекущийСтатус = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.ГотовКВыдаче") Тогда
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='заказ выкуплен'"),,ЦветаСтиля.ГиперссылкаЦвет,,"ПередатьДанныеОВыкупленномЗаказе"));
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru=' или '")));
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='заказ возвращен на склад.'"),,ЦветаСтиля.ГиперссылкаЦвет,,"ПередатьДанныеОВозвращенномЗаказе"));
	ИначеЕсли ТекущийСтатус = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.Продан") Тогда
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='действие не требуется.'")))
	ИначеЕсли ТекущийСтатус = ПредопределенноеЗначение("Перечисление.ор_СтатусыОбменаАптекаРУ.Возвращен") Тогда
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='действие не требуется.'")))
	Иначе
		ФорматированныеСтроки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='заказ привезен в аптеку.'"),,ЦветаСтиля.ГиперссылкаЦвет,,"ПередатьДанныеОПривезенномЗаказе"))
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ФорматированныеСтроки);
	
КонецФункции

// Выполняет установку параметров сеанса. Вызывается из модуля сеанса.
//
// Параметры:
//  ИмяПараметра			 - Строка           - имя параметра сеанса.
//  УстановленныеПараметры	 - Массив из Строка - все установленные параметры сеанса.
//
Процедура УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	ПараметрыСеанса.ор_ДанныеСессииАптекаРУ = Новый ФиксированноеСоответствие(Новый Соответствие());
	
	УстановленныеПараметры.Добавить(ИмяПараметра);
	
КонецПроцедуры

#Область HTTP

// Функция - Выполнить запрос
//
// Параметры:
//  АдресЗапроса				 - Строка - адрес запроса сервиса
//  ТелоЗапросаJSON				 - Строка - тело запроса в формате JSON
//  ПолучениеТокенаАвторизации	 - Булево - признак того, что это получение токена авторизации
//  ДокументСсылка				 - ДокументСсылка.ЗаказПокупателя - ссылка на заказ покупателя
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьЗапрос(АдресЗапроса, ТелоЗапросаJSON, ПолучениеТокенаАвторизации = Ложь, Организация = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстОшибки" , "");
	ВозвращаемоеЗначение.Вставить("ОбъектОтвет" , Неопределено);
	
	ЗаголовокHTTP = ор_ОбменСАптекаРУПовтИсп.ПолучитьСоответствиеЗаголовковHTTPСоединения();
	
	Если Не ПолучениеТокенаАвторизации Тогда
		ТокенАвторизации = ПолучитьТокенАвторизации(Организация);
		ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", ТокенАвторизации));
	КонецЕсли;
	
	HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, ЗаголовокHTTP);
	#Если ВебКлиент Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8);
	#Иначе
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	#КонецЕсли
	
	Попытка
		
		// Формируем параметры HTTP Соединения
		Параметры = ор_ОбменСАптекаРУПовтИсп.ПолучитьПараметрыHTTPСоединения();
		
		// Выполняем HTTP Соединение
		HTTPСоединение = Новый HTTPСоединение(Параметры.Сервер, Параметры.Порт,,,, Параметры.Таймаут, Параметры.ЗащищенноеСоединение, Ложь);
		
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ИсходныйТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		
		Если HTTPОтвет.КодСостояния = 200 Тогда
			
			ОбъектОтвет = ТекстJSONВОбъект(ИсходныйТекстОтвета, Ложь);
			Если ОбъектОтвет <> Неопределено Тогда
				ВозвращаемоеЗначение.ОбъектОтвет = ОбъектОтвет;
			Иначе
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Формат данных отличается от ожидаемого
						       |%1'"),
					ИсходныйТекстОтвета);
			КонецЕсли;
			
		Иначе
			Если ЗначениеЗаполнено(ИсходныйТекстОтвета) Тогда
				ВозвращаемоеЗначение.ТекстОшибки = ИсходныйТекстОтвета;
			Иначе
				ВозвращаемоеЗначение.ТекстОшибки = 
				СтрШаблон(НСтр("ru = 'Ошибка при выполнении запроса POST %1 в Аптека.ру %2. Код ошибки: %3'"),
					АдресЗапроса, Параметры.Сервер, HTTPОтвет.КодСостояния);
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		
		ВозвращаемоеЗначение.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обмен Аптека.ру'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			СтрШаблон(
				НСтр("ru = 'Ошибка при выполнении запроса POST %1 в Аптека.ру %2'"),
				АдресЗапроса, Параметры.Сервер) + Символы.ПС +
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		#КонецЕсли
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область Авторизация

// Функция - Запросить токен авторизации из сервиса
//
// Параметры:
//  Логин	 - Строка - текущий логин
//  Пароль	 - Строка - текущий пароль
// 
// Возвращаемое значение:
//  Структура - структура возвращаемого значения
//
Функция ЗапроситьТокенАвторизацииИзСервиса(Логин, Пароль) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТекстОшибки"       , "");
	ВозвращаемоеЗначение.Вставить("Токен"             , "");
	ВозвращаемоеЗначение.Вставить("ВремяЖизниВМинутах", "");
	
	АдресЗапроса = "/Auth";
	
	ТелоЗапроса = Новый Структура();
	ТелоЗапроса.Вставить("login"    , Логин);
	ТелоЗапроса.Вставить("password" , Пароль);
	
	ТелоЗапросаJSON = ОбъектВТекстJSON(ТелоЗапроса);
	
	ОтветСервиса = ВыполнитьЗапрос(АдресЗапроса, ТелоЗапросаJSON, Истина);
	ОбъектОтвет = ОтветСервиса.ОбъектОтвет;
	Если ЗначениеЗаполнено(ОтветСервиса.ТекстОшибки) Тогда
		ВозвращаемоеЗначение.ТекстОшибки = ОтветСервиса.ТекстОшибки;
	ИначеЕсли ОбъектОтвет <> Неопределено
				И ОбъектОтвет.Свойство("token")
				И ОбъектОтвет.Свойство("lifetimeInMinutes") Тогда
		
		ВозвращаемоеЗначение.Токен              = ОбъектОтвет.token;
		ВозвращаемоеЗначение.ВремяЖизниВМинутах = ОбъектОтвет.lifetimeInMinutes;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Функция - Получить токен авторизации
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - ссылка на организацию
// 
// Возвращаемое значение:
//  Строка - токен для авторизации в сервисе
//
Функция ПолучитьТокенАвторизации(Организация)
	
	// Получим токен из параметров сеанса, если есть.
	// При этом если токен истек тут же обновим его.
	ДанныеПоОрганизации = ПараметрыСеанса.ор_ДанныеСессииАптекаРУ.Получить(Организация);
	Если ДанныеПоОрганизации <> Неопределено 
		И ДанныеПоОрганизации.Свойство("Токен")
		И ДанныеПоОрганизации.Свойство("СрокДействия")
		И ДанныеПоОрганизации.СрокДействия > ТекущаяДатаСеанса() Тогда
		
		Возврат ДанныеПоОрганизации.Токен;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ор_НастройкиОбменаСАптекаРУ.Логин КАК Логин,
		|	ор_НастройкиОбменаСАптекаРУ.Пароль КАК Пароль,
		|	ор_НастройкиОбменаСАптекаРУ.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ор_НастройкиОбменаСАптекаРУ КАК ор_НастройкиОбменаСАптекаРУ
		|ГДЕ
		|	ор_НастройкиОбменаСАптекаРУ.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		РезультатЗапроса = ЗапроситьТокенАвторизацииИзСервиса(Выборка.Логин, Выборка.Пароль);
		ЗаполнитьПараметрыСеанса(Выборка.Организация, РезультатЗапроса.Токен, РезультатЗапроса.ВремяЖизниВМинутах);
		Возврат РезультатЗапроса.Токен;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектВТекстJSON(Структура, УдалитьПробелыИПереносыСтрок = Ложь)
	
	ТекстJSON = "";
	
	Если УдалитьПробелыИПереносыСтрок Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");
	Иначе
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ТекстJSONВОбъект(ТекстJSON, ПреобразовыватьВСоответствие = Ложь)
	
	РезультатРазбора = Неопределено;
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	
	Попытка
		РезультатРазбора = ПрочитатьJSON(Чтение, ПреобразовыватьВСоответствие);
	Исключение
		РезультатРазбора = Неопределено;
	КонецПопытки;
	
	Возврат РезультатРазбора;
	
КонецФункции

Функция ОбновитьТекущийСтатусЗаказаНаОснованииОтветаСервиса(МассивЗаказов, МассивОтвета, ВозвращаемоеЗначение, Действие, СоответствиеЗаказНомер)
	
	ТекущиеСтатусыЗаказов = ПолучитьТекущиеСтатусыЗаказов(МассивЗаказов);
	
	Для Каждого ЭлементОтвета Из МассивОтвета Цикл
		
		СтатусАптекаРУ   = ЭлементОтвета.status;
		СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.ПустаяСсылка();
		
		Если СтатусАптекаРУ = "Success" Тогда
			СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.Success;
		ИначеЕсли СтатусАптекаРУ = "Conflict" Тогда
			СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.Conflict;
		ИначеЕсли СтатусАптекаРУ = "Unknown" Тогда
			СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.Unknown;
		ИначеЕсли СтатусАптекаРУ = "NotFound" Тогда
			СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.NotFound;
		ИначеЕсли СтатусАптекаРУ = "AlreadyReported" Тогда
			СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.AlreadyReported;
		КонецЕсли;
		
		ЗаказПокупателя = СоответствиеЗаказНомер.Получить(ЭлементОтвета.orderNum);
		Если ЗаказПокупателя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтатусОбмена = СформироватьФактическийСтатусОбменаЗаказа(ЗаказПокупателя, Действие, СтатусАптекаРуИБ, ТекущиеСтатусыЗаказов);
		
		// В случае, если по измерению ЗаказПокупателя уже есть запись, она будет замещена новой.
		МенеджерЗаписи = РегистрыСведений.ор_СтатусыИнформированияАптекаРУ.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗаказПокупателя = ЗаказПокупателя;
		МенеджерЗаписи.СтатусОбмена    = СтатусОбмена;
		МенеджерЗаписи.СтатусАптекаРУ  = СтатусАптекаРуИБ;
		
		Если ЭлементОтвета.Свойство("errorMessage")
			И Не (СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.Success) Тогда
			МенеджерЗаписи.СообщениеОбОшибке = СтрШаблон(НСтр("ru = '%1.%2'"), Строка(СтатусАптекаРуИБ), ЭлементОтвета.errorMessage);
		КонецЕсли;
		
		МенеджерЗаписи.Записать();
		
		ВозвращаемоеЗначение.СообщениеСервисаДляЭлемента = МенеджерЗаписи.СообщениеОбОшибке;
		
		ВозвращаемоеЗначение.ПредставлениеСтатуса = СформироватьПредставлениеСтатусаЗаказа(СтатусОбмена);
		ВозвращаемоеЗначение.СтатусОбмена         = СтатусОбмена;
	КонецЦикла;
	
КонецФункции

Функция СформироватьФактическийСтатусОбменаЗаказа(ЗаказПокупателя, Действие, СтатусАптекаРуИБ, ТекущиеСтатусыЗаказов)
	
	// Если передача успешна, вставляем статус текущей операции.
	Если СтатусАптекаРуИБ = Перечисления.ор_СтатусыИнформированияАптекаРУ.Success Тогда
		Если НРег(Действие) = НРег("ПередатьДанныеОПривезенномЗаказе") Тогда
			СтатусОбмена =  Перечисления.ор_СтатусыОбменаАптекаРУ.Принят;
		ИначеЕсли НРег(Действие) = НРег("ПередатьДанныеОГотовностиКВыдачеЗаказа") Тогда
			СтатусОбмена =  Перечисления.ор_СтатусыОбменаАптекаРУ.ГотовКВыдаче;
		ИначеЕсли НРег(Действие) = НРег("ПередатьДанныеОВыкупленномЗаказе") Тогда
			СтатусОбмена =  Перечисления.ор_СтатусыОбменаАптекаРУ.Продан;
		ИначеЕсли НРег(Действие) = НРег("ПередатьДанныеОВозвращенномЗаказе") Тогда
			СтатусОбмена = Перечисления.ор_СтатусыОбменаАптекаРУ.Возвращен;
		КонецЕсли;
		Возврат СтатусОбмена;
	КонецЕсли;
	
	Статус = ПолучитьТекущийСтатусЗаказа(ЗаказПокупателя, ТекущиеСтатусыЗаказов).СтатусОбмена;
	Возврат Статус;
	
КонецФункции

#КонецОбласти
